; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	spectrograph0 - mode
	spectrograph2 - mode
	infrared1 - mode
	Star2 - direction
	Star7 - direction
	Star5 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star8 - direction
	Star1 - direction
	Star6 - direction
	GroundStation4 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 infrared1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star1)
	(supports instrument3 spectrograph0)
	(supports instrument3 spectrograph2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 Star2)
	(supports instrument4 spectrograph2)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 Star5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star12)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star8)
	(supports instrument6 spectrograph2)
	(supports instrument6 spectrograph0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 Star8)
	(supports instrument7 spectrograph2)
	(supports instrument7 infrared1)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 Star8)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star11)
	(supports instrument8 infrared1)
	(supports instrument8 spectrograph0)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 GroundStation4)
	(calibration_target instrument8 Star6)
	(calibration_target instrument8 Star1)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star7)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(pointing satellite1 GroundStation3)
	(pointing satellite3 GroundStation4)
	(have_image Planet9 infrared1)
	(have_image Phenomenon10 infrared1)
	(have_image Star11 infrared1)
	(have_image Star12 spectrograph0)
	(have_image Phenomenon13 infrared1)
))

)

; plan
1. (turn_to satellite3 groundstation4 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 groundstation4)
   goals met: 1 of 8
2. (turn_to satellite1 groundstation4 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 groundstation4)
   goals met: 1 of 8
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 8
4. (calibrate satellite1 instrument2 groundstation4)
   added: (calibrated instrument2)
   goals met: 1 of 8
5. (turn_to satellite1 phenomenon13 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 8
6. (take_image satellite1 phenomenon13 instrument2 infrared1)
   added: (have_image phenomenon13 infrared1)
   goals met: 2 of 8
7. (turn_to satellite1 phenomenon10 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 8
8. (turn_to satellite0 groundstation4 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation4)
   goals met: 3 of 8
9. (take_image satellite1 phenomenon10 instrument2 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 4 of 8
10. (turn_to satellite1 planet9 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet9)
   goals met: 4 of 8
11. (take_image satellite1 planet9 instrument2 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 5 of 8
12. (turn_to satellite1 star11 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star11)
   goals met: 5 of 8
13. (take_image satellite1 star11 instrument2 infrared1)
   added: (have_image star11 infrared1)
   goals met: 6 of 8
14. (turn_to satellite1 star12 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star12)
   goals met: 6 of 8
15. (take_image satellite1 star12 instrument2 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 7 of 8
16. (turn_to satellite1 groundstation3 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 groundstation3)
   goals met: 8 of 8
